[
    {
        "id": 1,
        "references": [1],
        "year": 470,
        "title": "Socrates, Plato, and Aristotle",
        "summary": "Socrates, Plato, and Aristotle were Greek philosophers who started thinking about psychology. Socrates beleived in dualism, the idea that our thoughts are separate from our bodies. Aristotle believed that we are not inherently born with knowledge, but rather, we gain knowledge through observing the world around us. Much later, from the 1500s to the 1800s, came Rene Descartes, John Locke, Thomas Hobbes, and Charles Darwin who all helped to advance psychology."
    },
    {
        "id": 2,
        "references": [1],
        "year": 1879,
        "title": "First Psychological Laboratory",
        "summary": "In 1879, Wilhelm Wundt founded the first psychological laboratory in Germany at the University of Leipzig, helping to advance psychology as a science. This laboratory helped produce many students who would then go on to other universities, spreading the science of psychology."
    },
    {
        "id": 3,
        "references": [1, 2],
        "year": 1898,
        "title": "Titchener and Structuralism",
        "summary": "Titchener was a student of Wundt's who went on to Cornell University. He was inspired by the findings in chemistry and physics that molecules were made of atoms, and similarly, Titchener wanted to break down thoughts into its smallest parts, physical sensations, feelings, and memories. His idea that we could break down psychology into these parts was called structuralism, but structuralism did not last long or make much of an impact in psychology."
    },
    {
        "id": 4,
        "references": [1, 3],
        "year": 1870,
        "title": "William James and Functionalism",
        "summary": "William James disagreed with Titchener's structuralism, and instead believed that physical sensations, feelings, and memories are all intertwined in our mind, and we cannot separate them as Titchener believed we could. William James focused on how we use our perception to adapt to our environments. These thoughts on psychology became known as functionalism."
    },
    {
        "id": 5,
        "references": [1, 4],
        "year": 1900,
        "title": "Sigmund Freud and Psychodynamic Psychology",
        "summary": "Sigmund Freud's ideas were drastically different from previous psychological theories due to their focus on the unconcious part of our minds. He insisted that we are driven by unconcious instincts, meaning that we may not be in full control of our behavior. No other psychologist had focused on the unconcious in this way before, and people believed that we were fully aware of our intentions and thoughts. This became the foundation of psychodynamic theory."
    },
    {
        "id": 6,
        "references": [1],
        "year": 1960,
        "title": "Behaviorism",
        "summary": "John B. Watson believed that human behavior is a result of conditioning, or training, and that our thoughts and feelings are purely physical responses to conditioning. This ideology is called behaviorism. One of Watson's famous experiments was called the Little Albert experiment. He made a loud sound whenever an 11-month old baby touched a rat. This conditioned the baby to fear white, furry things, and the baby began to cry in fear whenever he saw a similar object. B.F. Skinner also believed in behaviorism and that psychology is the study of observable behaviors. Like Watson, Skinner studied conditioning, but he also studied reinforcement, or providing rewards for desired behaviors."
    },
    {
        "id": 7,
        "references": [1, 5],
        "year": 1970,
        "title": "Cognitive Psychology",
        "summary": "Following behaviorism came cognitive psychology. Unlike behaviorism, cognitive psychology focused on mental processes rather than behaviors. Cognitive psychology changed the definition of psychology by including thoughts and feelings in the idea of behavior. This new field of psychology included the study of thoughts, feelings, learning, and memories."
    },
    {
        "id": 8,
        "references": [1, 6],
        "year": 1980,
        "title": "Evolutionary Psychology",
        "summary": "Evolutionary psychology focused on how humans came to be the way we are, why we behave the way we do, and how our mental processes evolved."
    },
    {
        "id": 9,
        "references": [1],
        "title": "Naturalistic Observation",
        "summary": "Naturalistic observation is a research method used by psychologists to study the natural behavior of humans or animals. For example, psychologists might study people at school, in their workplace, or at home, and others may study wild animals in their natural habitat."
    },
    {
        "id": 10,
        "references": [1],
        "title": "Case Study",
        "summary": "Psychologists also use case studies for research. A case study is a focused study on one or a couple people. These studies often involve psychological tests, observation, and interviews. A lot of valuable information and research can be gained through case studies; however, they are also quite limited because we cannot create generalizations based on a single individual."
    },
    {
        "id": 11,
        "references": [1],
        "title": "Experiments",
        "summary": "Psychologists also use experimental research. This research method involves using the scientific method, independent and dependent variables, and experimental groups and a control group."
    }
]